In [1]:
import numpy as np 
from pandas import Series, DataFrame

In [3]:
np.arange(1,17).reshape(4,4)

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [4]:
DataFrame(np.arange(1,17).reshape(4,4))

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [5]:
df1 = DataFrame(np.arange(1,17).reshape(4,4))
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [7]:
# dir(df1)

In [10]:
df1.sum(axis=0) # 서로 다른 행끼리, 세로 방향

0    28
1    32
2    36
3    40
dtype: int64

In [9]:
df1.sum() # axis=0 : default

0    28
1    32
2    36
3    40
dtype: int64

In [11]:
df1.sum(axis=1) # 서로 다른 열끼리, 가로방향

0    10
1    26
2    42
3    58
dtype: int64

In [12]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [13]:
df1.iloc[:,0]

0     1
1     5
2     9
3    13
Name: 0, dtype: int32

In [14]:
df1.iloc[:,0].sum()

28

In [15]:
df1.iloc[:,0].mean()

7.0

In [16]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [17]:
df1.iloc[0,0] = np.nan
df1

      0   1   2   3
0   NaN   2   3   4
1   5.0   6   7   8
2   9.0  10  11  12
3  13.0  14  15  16

In [21]:
df1.iloc[:,0].mean()
# skipna = True (default)
# 자동으로 NaN 무시

9.0

In [23]:
# NaN(결측치) 처리하고 싶어라
# 평균값, 최대값, 최속값 대체 

df1.iloc[:,0].isnull() # 조건

0     True
1    False
2    False
3    False
Name: 0, dtype: bool

In [25]:
df1.iloc[:,0][df1.iloc[:,0].isnull()] =  df1.iloc[:,0].mean()

C:\Users\student\AppData\Local\Temp\ipykernel_9728\3451827632.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.iloc[:,0][df1.iloc[:,0].isnull()] =  df1.iloc[:,0].mean()

In [26]:
df1

      0   1   2   3
0   9.0   2   3   4
1   5.0   6   7   8
2   9.0  10  11  12
3  13.0  14  15  16

In [28]:
df1[df1.isnull()]

    0   1   2   3
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN

In [29]:
df1

      0   1   2   3
0   9.0   2   3   4
1   5.0   6   7   8
2   9.0  10  11  12
3  13.0  14  15  16

In [31]:
df1.iloc[:,0].var() # 분산

10.666666666666666

In [33]:
df1.iloc[:,0].std() # 표준편차 (standard deviation)

3.265986323710904

In [34]:
df1.iloc[:,0].min()

5.0

In [35]:
df1.iloc[:,0].max()

13.0

In [36]:
df1.iloc[:,0].median() # 중위수(중앙값)

9.0

In [37]:
df1.iloc[:,0] >= 10

0    False
1    False
2    False
3     True
Name: 0, dtype: bool

In [38]:
# 조건에 만족하는 갯수 확인
(df1.iloc[:,0] >= 10).sum()

1